{
  "home": {
    "name": "Hola, soy Joaquin Villarreal",
    "description": "Transformando ideas en experiencias digitales con código y creatividad, especializado en aplicaciones web elegantes y centradas en el usuario."
  },
  "sections": {
    "home": "Inicio",
    "experience": "Experiencia",
    "proyects": "Proyectos",
    "about": "Sobre mí",
    "contact": "Contacto"
  },
  "buttons": {
    "contact": "contáctame",
    "cv": "Descargar cv",
    "online": "Ver online",
    "repository": "Repositorio",
    "more_proyects": "Más Proyectos"
  },
  "experiences": {
    "storydots" : {
      "title": "StoryDots",
      "job_title": "Full Stack developer",
      "time": "abril 2024 - actualidad",
      "description":
      "En Story Dots, mi enfoque se centra en el desarrollo de aplicaciones en la nube orientadas al comercio electrónico, con énfasis en plataformas populares como Tienda Nube y Shopify, entre otras."
    },
    "vintex": {
      "title": "Vintex",
      "job_title": "Desarrollador de Software (Freelance)",
      "time": "Diciembre 2023 - Actualidad",
      "description": "Trabajo como desarrollador de software de manera freelance y a tiempo parcial. Me encargo de proyectos de desarrollo de software cada cierto tiempo."
    },
    "fooTalent": {
      "title": "Foo Talent",
      "job_title": "Desarrollador Full Stack",
      "time": "Julio 2023 - Noviembre 2023",
      "description": "Participé en la creación del sitio web y en el desarrollo del backend para una startup de abogados en Perú. Mi responsabilidad incluyó la creación de un sistema de seguimiento de casos que permitiera a los usuarios verificar el estado específico de sus asuntos legales.",
      "items": [
        "Diseñé interfaces de usuario para mejorar la experiencia del usuario en diversos dispositivos.",
        "Colaboré de manera efectiva en equipos de desarrollo, facilitando la comunicación y la resolución de problemas.",
        "Mantuve y mejoré constantemente la calidad y el rendimiento del código."
      ]
    },
    "freelance": {
      "title": "Desarrollador Freelance",
      "time": "Marzo 2022 - Actualidad",
      "description": "Trabajo como freelancer en diversos proyectos desde marzo de 2022."
    }
  },
  "proyects": {
    "proyect1": {
      "title": "Rapid Format",
      "description": "Una herramienta web que simplifica la conversión y visualización de datos entre formatos JSON y objetos. Nuestra plataforma cuenta con una interfaz intuitiva para que los usuarios ingresen datos JSON o estructuras de objetos y obtengan una representación formateada, fácil de entender y lista para implementar. Además, incluye tests usando Playwright."
    },
    "proyect2": {
      "title": "Gestor de gastos",
      "description": "Un administrador de gastos simple y eficiente creado con Next.js para ayudarlo a realizar un seguimiento de los ingresos, los gastosy visualizar sus datos financieros."
    },
    "proyect3": {
      "title": "Rooms (Proyecto de Salas en Tiempo Real)",
      "description": "Este es un proyecto de sistema de chat en tiempo real desarrollado con el objetivo de implementar la libreria de Socket.io y explorar tecnologías como React, TypeScript, Node.js, Express, MongoDB y JWT."
    },
    "proyect4": {
      "title": "Travel Nest - Proyecto Open source",
      "description": "Plataforma de gestión de alquileres de departamentos, con funciones de reserva, registro y autenticación. Incorpora medidas de seguridad avanzadas con tokens de acceso y de actualización. Utiliza la API de Google Maps para la ubicación y ChatGPT para recomendaciones personalizadas de departamentos."
    },
    "proyect5": {
      "title": "Reading List",
      "description": "es una mini tienda la cual el usuario puede arrastrar y soltar el libro que desee a una lista de lectura. Tiene permanencia de datos con localStorage y sincronizacion entre pestañas. Esta hecho con react, typescript y styled components."
    },
    "proyect6": {
      "title": "Reclama Smart (Proyecto Freelance)",
      "description": "Proyecto Freelance, creacion de sitio web para una start up de abogados."
    },
    "proyect7": {
      "title": "Pokemon game 'who is that pokemon'",
      "description": "Proyecto de juego de Pokémon donde los usuarios adivinan nombres para ganar puntos. Utiliza React para la interfaz y una API externa para obtener información de Pokémon. El objetivo es acumular la mayor cantidad de puntos antes de perder toda la vida."
    }
  },
  "aboutme": {
    "who_i_am": {
      "title": "Quien soy?"
    },
    "paragraph1": {
      "prayer1": "Soy un Desarrollador fullstack con más de",
      "prayer2": "1 año de experiencia",
      "prayer3": "en el mundo del desarrollo web. Originario de",
      "prayer4": "Buenos Aires, Argentina",
      "prayer5": "21 años.",
      "prayer6": "Mi enfoque se centra en la creación de",
      "prayer7": "experiencias digitales excepcionales",
      "prayer8": "utilizando",
      "prayer9": "tecnologías modernas",
      "prayer10": "y las mejores prácticas de desarrollo. Me gusta",
      "prayer11": "contribuir al mundo del código abierto",
      "prayer12": "y disfruto colaborar en",
      "prayer13": "proyectos open source",
      "prayer14": ", así como compartir conocimientos con la comunidad.",
      "extra": ", tengo"
    },
    "technologies": {
      "title": "Explorando Tecnologías"
    },
    "paragraph2": {
      "prayer1": "En mi día a día, me sumerjo en un conjunto de habilidades que abarcan tecnologías como",
      "prayer2": "y muchas otras. Siempre estoy en la búsqueda de aprender",
      "prayer3": "nuevas tecnologías",
      "prayer4": "y mantenerme actualizado con las",
      "prayer5": "tendencias del desarrollo",
      "prayer7": "Mi pasión radica en discutir",
      "prayer8": "ideas",
      "prayer9": "y colaborar en",
      "prayer10": "proyectos innovadores",
      "prayer11": "¡Conéctate conmigo para compartir tus ideas y explorar nuevas posibilidades!"
    }
  },
  "contact": {
    "title": "Contacto",
    "paragraph1": "¡Encantado de conocerte! Si tienes alguna pregunta, propuesta de colaboración o simplemente te gustaría charlar, no dudes en ponerte en contacto conmigo.",
    "paragraph2": "Por el momento, prefiero evitar la creación de formularios para simplificar el proceso de contacto. Sin embargo, puedes enviarme un correo electrónico o conectarte conmigo en LinkedIn utilizando los siguientes enlaces:",
    "gmail": "Enviar correo electrónico",
    "linkedin": "Conectá conmigo en LinkedIn"
  },
  "footer": {
    "text1": "Hecho con",
    "text2": "y",
    "text3": "por"
  }
}